[Killed] ConditionalExpression
src/calculator.js:10:13
     }
 
     addStudent(student) {
-        if (!(student instanceof Student)) {
+        if (false) {
             return -1;
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:18:13
     }
 
     getStudentById(id) {
-        if (id < 0 || id >= this.students.length) {
+        if (id >= 0 || id >= this.students.length) {
             return null;
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] EqualityOperator
src/calculator.js:31:13
     }
 
     setName(userName) {
-        if (typeof userName !== 'string') {
+        if (typeof userName === 'string') {
             return;
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
ok 1 - Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:38:13
     }
 
     getName() {
-        if (this.name === undefined) {
+        if (true) {
             return '';
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent

[Killed] ConditionalExpression
src/calculator.js:38:13
     }
 
     getName() {
-        if (this.name === undefined) {
+        if (false) {
             return '';
         }
killedBy: All tests
statusReason: > hw4@1.0.0 test
> node --test


TAP version 13

# Subtest: Test MyClass's addStudent
